app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["body", "A tweet for the good!"], ["created_at", "2020-04-19 21:18:55.070834"], ["updated_at", "2020-04-19 21:18:55.070834"]]
---
  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user_id = current_user.id
    if @tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def like
    @tweet = Tweet.find(params[:id])

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def dislike
    @tweet = Tweet.find(params[:id])

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 1]]
---
  def destroy
    @tweet = Tweet.find(params[:id])
    @tweet.destroy