app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets"
---
  def profile
    @userid = params[:user_id]
    @userinfo = User.find(params[:user_id])
    @usercount = @userinfo.tweets
    @tweets = Tweet.all